# Transformation de données - Anonymisation

Note importante:  Cest la elimination fisique, pas de cacher les donnes.

# Exercice 1 :
En considérant le fichier data_patient.csv, procéder à la suppression de l’attribut PATIENT.

In [6]:
import pandas as pd


df1 = pd.read_csv("data_patient.csv")
pd.options.display.max_columns = None
df1.head(10)

            patient reactif  resultat
0    Alain flouflou       A        79
1   Abdel flouclair       A        81
2  Annie clairclair       B        47

In [7]:
#delete a column
df_sortie = df1.drop("patient", axis=1)
df_sortie

  reactif  resultat
0       A        79
1       A        81
2       B        47

# Exercice 2 :
En considérant le fichier adresse_patient.csv, procéder à la suppression de l’enregistrement dont le patient_ID est 83.

In [8]:
df2 = pd.read_csv("adresse_patient.csv")
pd.options.display.max_columns = None
df2.head(10)

   patient id    age            adresse
0          45  21-35        rue du parc
1          83  40-60  rue des templiers
2         121  36-39      rue de minuit

In [9]:
df_sortie = df2.drop(df2[ df2['patient id'] == 83].index)
df_sortie

   patient id    age        adresse
0          45  21-35    rue du parc
2         121  36-39  rue de minuit

# Exercice 3 :
En considérant le fichier data_livraison.csv, procéder au maskage de l’attribut code_postal. Le format en sortie serait de la forme : ZY* ***   où ZY sont les deux premiers digits du code postal original.

In [10]:
df3 = pd.read_csv("data_livraison.csv")
pd.options.display.max_columns = None
df3.head(10)

  code postal periode livraison  nombre colis
0     H1X 3S7           10H-12H             3
1     H2Y 4O3           12H-17H             4
2     H1W 5P5           17H-20H             1

In [11]:
data = "Ricardo"
startposition = 2

df3["coded"] = df3["code postal"].map(lambda x:x[0:2]+"****")
df3 = df3.drop("code postal", axis=1)
df3

  periode livraison  nombre colis   coded
0           10H-12H             3  H1****
1           12H-17H             4  H2****
2           17H-20H             1  H1****

# Exercice 4 :
En considérant le fichier reactif_patient.csv, procéder à la pseudonymisation de Patient. La table de correspondance est la suivante : (obfuscation)

In [12]:
df4 = pd.read_csv("reactif_patient.csv")
pd.options.display.max_columns = None
df4.head(10)

            patient reactif  resultat
0    Alain flouflou       A        79
1   Abdel flouclair       A        81
2  Annie clairclair       B        47

In [13]:
dict1 = {"Alain flouflou":"7815","Abdel flouclair":"5314","Annie clairclair":"4718"}

df4.patient = df4.patient.replace(dict1)
df4

  patient reactif  resultat
0    7815       A        79
1    5314       A        81
2    4718       B        47

# Exercice 5:
En considérant le fichier data_patient_age.csv, procéder à une anonymisation de la série age en utilisant les intervalles d’age au lieu de l’age exact. La table d’intervalle est la suivante :

In [14]:
df5 = pd.read_csv("data_patient_age.csv")
pd.options.display.max_columns = None
df5.head(10)

            patient  age reactif  resultat
0    Alain flouflou   25       A        79
1   Abdel flouclair   35       A        81
2  Annie clairclair   45       B        47

In [28]:
df5['age_interval'] = df5['age'].map(lambda x: "<20" if  x< 20 
                                     else "20-30" if x<30 
                                     else "31-40" if x < 40
                                     else "41-50" if x<50 
                                     else "> 50")
df5

            patient  age reactif  resultat  re   re2 age_interval
0    Alain flouflou   25       A        79  47  80.0        20-30
1   Abdel flouclair   35       A        81  81  80.0        31-40
2  Annie clairclair   45       B        47  79  45.0        41-50

# 6.  permutation elements meme column

In [24]:
df5["re"]= df5["resultat"].sample(frac=1).reset_index(drop=True)
df5

            patient  age reactif  resultat  re
0    Alain flouflou   25       A        79  47
1   Abdel flouclair   35       A        81  81
2  Annie clairclair   45       B        47  79

# 7.  perturbation elements meme column

In [25]:
def myround(x, base=5):
    return base * round(x/base)

df5["re2"]= myround(df5["resultat"], 5)
df5

            patient  age reactif  resultat  re   re2
0    Alain flouflou   25       A        79  47  80.0
1   Abdel flouclair   35       A        81  81  80.0
2  Annie clairclair   45       B        47  79  45.0

In [30]:
#renommer la serie age_interval vers age
df5 = df5.rename(columns={'re2': 'ageBase5'})
df5

            patient  age reactif  resultat  re  ageBase5 age_interval
0    Alain flouflou   25       A        79  47      80.0        20-30
1   Abdel flouclair   35       A        81  81      80.0        31-40
2  Annie clairclair   45       B        47  79      45.0        41-50